
class MonthsData{

    final List monthInfo = [
    // First month
    [
    """بداية يناير أبرد أيام السنة وشدتها على معظم مناطق المملكة ويتكون الصقيع خاصة في الأماكن المكشوفة البراري وتزداد الرطوبة على معظم المناطق ويتكون الضباب وسحب النفيض وترتفع الحرارة نهاراً أحياناً
• أمطاره عامه وديمية إن الله أراد على معظم المناطق أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان فترة تساقط الثلوج على المناطق الشمالية  
\u202E• ٣ يناير الى ٨١ يناير يوافق اقصى مدى بالتأخر لشروق الشمس طوال العام - ٨ يناير الى ٠٢ يناير يوافق اقصى مدى في التأخر لصلاة الفجر طوال العام
\u202E•	٤١ يناير يدخل موسم الشبط أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع خاصة في الأماكن المكشوفة البراري والمرتفعات
•	فيه برد يسمى (برد الأزيرق) - يتكون فيه الضباب - ترتفع الحرارة نهاراً أحياناً 
•	يكثر به نشاط الرياح وتأتي فيه موجات غبار ويتكدر الجو قليل الامطار في الغالب أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان 
•	فترة تساقط الثلوج على المناطق الشمالية    
""",
    ['الشتاء'],
    [
      'https://i.postimg.cc/CKzBrPrX/winter-month.png',//'assets/images/winter_month.png',
      'https://i.postimg.cc/nzsJmhtW/highest1.png',//'assets/images/highest1.png',
      'https://i.postimg.cc/nLNH0DTx/lowest1.png',//'assets/images/lowest1.png',
      'https://i.postimg.cc/kg1MRZbB/rain1.png',//'assets/images/rain1.png',
      0xff65A8AF,
      0xff257179,
    ],
    [
      ['مكة', '33', '20,3', '17,5'],
      ['المدينة', '24,4', '12', '7,65'],
      ['الرياض', '20,6', '7,3', '14,4'],
      ['الدمام', '21,5', '9,9', '15,7'],
      ['الاحساء', '21,8', '8,8', '12,6'],
      ['القيصومة', '18,4', '6,2', '19,5'],
      ['القصيم', '19,8', '6,6', '17,7'],
      ['حائل', '17,7', '4', '11,5'],
      ['رفحاء','17','4,7','13,3'],
      ['الجوف','16,1','4,3','12,6'],
      ['عرعر','15,9','3,6','10,1'],
      ['طريف','13,3','1,8','12,3'],
      ['القريات','16','2,1','9,2'],
      ['تبوك','18,3','4,4','8,9'],
      ['الوجه','24,8','14','9.16'],
      ['ينبع','27,7','14,3','5,9'],
      ['جدة','28,9','18,7','10,9'],
      ['الطائف','22,9','8,7','9,1'],
      ['الباحة','22,8','10','7,7'],
      ['أبها','20','7,9','13,9'],
      ['جازان','30,9','21,9','11,9'],
      ['نجران','25,8','9,1','2,8'],
      ['خميس \nمشيط','21,7','8,3','6,6'],
      ['شروره','27,1','10,5','0,75'],
      ['وادي \nالدواسر','25','9,7','1,3'],
      ['بيشة','26,1','9,1','8,1']
    ],
    'https://www.keepandshare.com/doc21/115407/pdf-71k?da=y'
    ],

    // Second month
    [
    """\u202E• ٦ فبراير يوافق أيام (بذرة الست) وهي ٦ أيام صالحة لزراعة جميع المحاصيل حيث تكون في آخر ٣ أيام من الشبط وأول ٣ آيام من العقارب
• فترة تساقط الثلوج على المناطق الشمالية    
\u202E•	أول ٠١ أيام من فبراير تعتبر ضمن أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع خاصة في الأماكن المكشوفة البراري والمرتفعات - يتكون فيه الضباب - ترتفع الحرارة أحياناً نهاراً 
•	٨ فبراير نهاية موسم الشبط
•	٩ فبراير يدخل موسم العقارب 
\u202E•	١١ فبراير الأجواء لاتزال باردة على معظم المناطق يأتي فيه أيام دفء تعقبها موجة برد وبرده شديد يتكون فيه الضباب - تقل فيه الامطار على معظم المناطق وتكون أمطاره غزيرة في مواسم قليلة أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان 
•	تنشط فيه الرياح والأجواء تكون متكدرة يأتي فيه موجات غبار على مناطق المملكة   
•	نهاية حالات الكسير على سواحل البحر الأحمر
\u202E•	٢٢ فبراير الأجواء لازالت باردة على معظم المناطق انكسار حدة البرد الأجواء باردة صباحاً تميل للاعتدال والحرارة ظهراً يأتي فيه برد بعد موجة دفء يسمى (برد العجوز) 
•	نهاية موسم تساقط الثلوج على المناطق الشمالية 
    """,
    ['الشتاء'],
    [
     'https://i.postimg.cc/CKzBrPrX/winter-month.png',
      'https://i.postimg.cc/qBhJhjJ7/highest2.png',//'assets/images/highest2.png',
      'https://i.postimg.cc/xTLbH0fq/lowest2.png',//'assets/images/lowest2.png',
      'https://i.postimg.cc/QdXVT1Yn/rain2.png',//'assets/images/rain2.png',
      0xff65A8AF,
      0xff257179,

    ],
    [
      ['مكة', '31,3', '19,9', '2,3'],
      ['المدينة', '26,8', '13.9', '2,9'],
      ['الرياض', '23,4', '9,5', '8,9'],
      ['الدمام', '23,8', '11,4', '11,5'],
      ['الاحساء', '24,5', '10,7', '11,6'],
      ['القيصومة', '21,5', '8,2', '11,7'],
      ['القصيم', '22,9', '8,5', '9,33'],
      ['حائل', '20,1', '5,8', '7'],
      ['رفحاء','19,9','6,4','8,4'],
      ['الجوف','18,8','6,1','7,25'],
      ['عرعر','18,6','5,3','6,7'],
      ['طريف','15,6','3,3','10,8'],
      ['القريات','18,6','3,8','5,13'],
      ['تبوك','20,9','6,4','1,7'],
      ['الوجه','25,4','14,6','3,5'],
      ['ينبع','27,7','14,3','5,9'],
      ['جدة','29,7','18,7','2,9'],
      ['الطائف','24,9','10,1','1,5'],
      ['الباحة','24,7','11,7','1,26'],
      ['أبها','21,5','9,6','16'],
      ['جازان','31,3','22,8','4,16'],
      ['نجران','28,8','12','1,25'],
      ['خميس \nمشيط','23,2','10','8,5'],
      ['شروره','30,5','13,6','2,4'],
      ['وادي \nالدواسر','28,4','12,4','1'],
      ['بيشة','28,7','11,6','1']
    ],
    'https://www.keepandshare.com/doc21/115401/pdf-73k?da=y'

    ],
    // 3 month
        [
   """\u202E•	يتداخل فيه فصلي الشتاء والربيع يوافق ٦ أيام من فصل الشتاء – ٥٢ يوم من فصل الربيع 
\u202E•	٧ مارس دخول فصل الربيع محلياً الأجواء باردة صباحا تميل للاعتدال والحرارة ظهراً ويأتي فيه برد بعد دفء (برد بياع الخبل عباته) وتحدث فيه تقلبات جوية وأمطار وتنشط فيه الرياح المثيرة للغبار وتكدر الأجواء على المنطقة الوسطى والشرقية والشمالية
• التخفيف من الملابس الشتوية واخراج الملابس الربيعية لمعظم المناطق
•	أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان  
•	١٩ مارس نهاية موسم العقارب 
\u202E•	٠٢ مارس بداية موسم سبق السرايات أمطار الربيع (مراويح الصيف) الأجواء فيه متقلبة أمطار تساقط البرد الرياح الهابطة المثيرة للغبار تفاوت في درجات الحرارة بين ارتفاع وانخفاض على المناطق الشمالية الوسطى الشرقية - يأتي فيه احياناً برد يهلك الزرع يسمى (برد الحميمين) على الوسطى الشمالية 
\u202E•	١٢-٢٢ مارس الاعتدال الربيعي تعامد الشمس على خط الاستواء يتساوى فيه الليل والنهار ويبدأ النهار بالزيادة  
\u202E•	١٢ مارس بداية تأثير المنخفضات الخماسينية على المملكة مصدرها الصحراء الكبرى بأفريقيا 
المنخفضات الخماسينية (هي نشاط عالي للرياح السطحية المثيرة للغبار وارتفاع في درجات الحرارة يليه انخفاض) تكثر به أمراض الحساسية والزكام
    """,
    ['الشتاء', 'الربيع'],
    [
      'https://i.postimg.cc/CKzBrPrX/winter-month.png',
      'https://i.postimg.cc/ZnyMb9hT/highest3.png',//'assets/images/highest3.png',
      'https://i.postimg.cc/ZYGdC9h1/lowest3.png',//'assets/images/lowest3.png',
      'https://i.postimg.cc/Rh7V3Z7B/rain3.png',//'assets/images/rain3.png',
      0xff65A8AF,
      0xff257179,
    ],
    [
      ['مكة', '35,5', '21,6', '5,6'],
      ['المدينة', '30,7', '17.3', '7,5'],
      ['الرياض', '27,8', '13,7', '19,8'],
      ['الدمام', '28,9', '14,9', '8,6'],
      ['الاحساء', '29,3', '14,6', '15,4'],
      ['القيصومة', '26,7', '12,5', '15,8'],
      ['القصيم', '27,3', '12,6', '19,9'],
      ['حائل', '24,1', '9,7', '15,6'],
      ['رفحاء','25','10,5','13,5'],
      ['الجوف','23,4','9,9','6,7'],
      ['عرعر','23,65','9,3','7,7'],
      ['طريف','20,1','6,6','11,9'],
      ['القريات','23','7','8'],
      ['تبوك','25,1','10','4,3'],
      ['الوجه','27,3','16,7','1,6'],
      ['ينبع','31,4','17,3','1,1'],
      ['جدة','31,7','20','2,2'],
      ['الطائف','27,5','12,9','13,6'],
      ['الباحة','26,9','14,2','13,2'],
      ['أبها','23,4','11,5','38,4'],
      ['جازان','33','24,3','4,3'],
      ['نجران','31,7','15,9','14,4'],
      ['خميس \nمشيط','24,8','12','21'],
      ['شروره','34,3','17,7','15,6'],
      ['وادي \nالدواسر','23,3','16,6','5,2'],
      ['بيشة','31,6','15,2','11,8']
    ],
    'https://www.keepandshare.com/doc21/115403/pdf-75k?da=y'
    ],
    // 4 month
        [
   """•	استمرار موسم سبق السرايات أمطار الربيع (مراويح الصيف) الأجواء بمشيئة الله فيه متقلبة    أمطار تساقط البرد الرياح الهابطة المثيرة للغبار الأجواء تمييل للاعتدال صباحاً وترتفع الحرارة نهاراً على الوسطى والشرقية والغربية والشمالية 
•	تميل للبرودة صباحاً وليلاً على المناطق الشمالية والمرتفعات الجنوبية الغربية يأتي فيه احياناً برد يهلك الزرع يسمى (برد الحميمين) على المنطقة الوسطى والشمالية   - تكثر به أمراض الحساسية والزكام  
\u202E•	٥١ ابريل دخول موسم السرايات أمطار الربيع (مراويح الصيف) الأجواء بمشيئة الله تميل للحرارة نهاراً معتدلة صباحاً وليلاً فيه تقلبات الأجواء تكون شديدة سقوط الامطار وتساقط البرد وهبوب العواصف والرياح الهابطة المثيرة للغبار وتشكل موجات غبار كثيفة على مناطق الرياض القصيم حائل الشرقية الشمالية مكة المدينة نجران المرتفعات وشرق المرتفعات 
\u202E•	١٢ أبريل بداية نشاط الفترة الأولى لأعاصير ومنخفضات بحر العرب تنتهي ١٢ يونيو
•	في آخره يأتي فيه موجات برد على المناطق الشمالية وحائل تصل أحياناً الى مناطق القصيم والرياض  
•	٢٨ أبريل دخول موسم الكنة (كنة الثريا)
    """,
    ['الربيع'],
    [
      'https://i.postimg.cc/VsqypXTk/spring-month.png',
      'https://i.postimg.cc/G2ffnFV7/highest4.png',//'assets/images/highest4.png',
      'https://i.postimg.cc/KY8KdBng/lowest4.png',//'assets/images/lowest4.png',
      'https://i.postimg.cc/SKRsZqh6/rain4.png',//'assets/images/rain4.png',
      0xff6C7D47,
      0xff4E5A33,

    ],
    [
      ['مكة', '38,8', ' 24,8', '10,8'],
      ['المدينة', '35,2', '21,4', '8,9'],
      ['الرياض', '33,3', '18,7', '25'],
      ['الدمام', '34,4', '20,1', '10,8'],
      ['الاحساء', '35,3', '19,8', '21,1'],
      ['القيصومة', '33,2', '18,3', '14'],
      ['القصيم', '32,9', '17.8', '24,1'],
      ['حائل', '29,4', '14,8', '14,9'],
      ['رفحاء','31,2','16','10,9'],
      ['الجوف','29,3','15,1','4,8'],
      ['عرعر','29,7','14,8','7,1'],
      ['طريف','25,9','11,5','8,6'],
      ['القريات','23,8','11,3','4,8'],
      ['تبوك','30,4','14.7','2'],
      ['الوجه','29,9','19,7','0,6'],
      ['ينبع','34,7','20,8','0,3'],
      ['جدة','34,6','22,6','2,4'],
      ['الطائف','30,2','15,8','36,9'],
      ['الباحة','29,3','16,7','35,2'],
      ['أبها','25,5','13,1','48,8'],
      ['جازان','35,5','26,4','12,5'],
      ['نجران','34','18,8','20,8'],
      ['خميس \nمشيط','26,9','13,8','40,4'],
      ['شروره','37,5','21,5','16,2'],
      ['وادي \nالدواسر','36,8','21,1','12,4'],
      ['بيشة','33,9','18.4','35,3']
    ],
    'https://www.keepandshare.com/doc21/115375/pdf-73k?da=y'
    ],
    // 5 month
        [
   """\u202E•	يتداخل فصلي الربيع والصيف في شهر مايو حيث تكون ٠١ أيام من فصل الربيع - ١٢ يوم من فصل الصيف 
•	ارتفاع ملموس لدرجات الحرارة نهاراً   أجواء معتدلة ليلاً على معظم المناطق أجواء معتدلة على المرتفعات والمناطق الشمالية نهاراً
•	استمرار موسم السرايات أمطار الربيع (مراويح الصيف) تكون فيه تقلبات الأجواء بمشيئة الله بسقوط الامطار الغزيرة وتساقط البرد وهبوب العواصف والرياح الهابطة المثيرة للغبار والعواصف الغبارية الجدارية على مناطق الرياض القصيم حائل الشرقية الشمالية مكة المدينة نجران المرتفعات وشرق المرتفعات 
\u202E•	٥ مايو بداية شدة نشاط الأعاصير والمنخفضات المدارية على (بحر العرب) وتتأثر بها أحياناً جنوب الجزيرة العربية عمان اليمن وأجزاء من المملكة 
\u202E•	٠١ مايو نهاية الربيع   محلياً  ١١ مايو دخول فصل الصيف محلياً
\u202E•	٥١ مايو ترتفع الحرارة بشكل ملحوظ وتكون الأجواء حارة نهاراً وتكون معتدلة تميل للحرارة ليلا ً على معظم المناطق                 
•	بداية عدم انتظام حركة السحب وثقل حركتها يأتي فيه أمطار رعدية يصاحبها تساقط للبرد يصاحبها رياح هابطة مغبرة على مناطق الرياض القصيم حائل الشرقية الجوف الحدود الشمالية المدينة مكة السحب تمطر مكان نشأتها في الغالب تكون الأجواء معتدلة ممطرة على المرتفعات الجنوبية يصاحبها أمطار رعدية غزيرة تشمل الطائف وشرق المرتفعات وجازان معتدلة نهاراً باردة صباحاً على أقصى المناطق الشمالية والشمالية الغربية يأتي فيه موجات حر أحياناً على المناطق الشمالية 
\u202E•	٠٢ مايو نهاية المنخفضات الخماسينية ومنخفضات البحر المتوسط     
\u202E•	٣٢ مايو نهاية موسم السرايات على وسط وشمال وشرق المملكة   مع استمرار فرص الأمطار بصورة ضعيفة مع كثرة الغبار المصاحب لها  
\u202E•	٤٢ مايو دخول موسم البوارح (نشاط الرياح الشمالية الجافة المثيرة للغبار والعوالق الترابية أثناء النهار) وتؤثر على الشرقية الوسطى تتركز شرق وجنوب منطقة الرياض تصل للربع الخالي ومنطقة نجران وشرق المرتفعات والمرتفعات   تطال وبصورة اقل حائل والقصيم شرق الحدود الشمالية       
•	٢٨ مايو تعامد الشمس على الكعبة التعامد الأول    
    """,
    ['الربيع', 'الصيف'],
    [
      'https://i.postimg.cc/VsqypXTk/spring-month.png',
      'https://i.postimg.cc/HjDPVppb/highest5.png',//'assets/images/highest5.png',
      'https://i.postimg.cc/bwTDC32h/lowest5.png',//'assets/images/lowest5.png',
      'https://i.postimg.cc/j5JjbXCC/rain5.png',//'assets/images/rain5.png',
      0xff6C7D47,
      0xff4E5A33,

    ],
    [
      ['مكة', '42,3', '27,9', '2,2'],
      ['المدينة', '39,7', '25,9', '4,2'],
      ['الرياض', '39,5', '23,9', '5,4'],
      ['الدمام', '40,6', '25', '3'],
      ['الاحساء', '41,7', '25,1', '2,9'],
      ['القيصومة', '39,8', '24,2', '3,1'],
      ['القصيم', '39', '23,1', '7,1'],
      ['حائل', '34,6', '20', '5,7'],
      ['رفحاء','37,3','21.5','3,1'],
      ['الجوف','34,5','20,1','1,6'],
      ['عرعر','35,4','20,2','1,6'],
      ['طريف','31,2','16,2','3,2'],
      ['القريات','33,8','15,7','2,3'],
      ['تبوك','34,7','19','1,6'],
      ['الوجه','32,2','22,7','0,4'],
      ['ينبع','38,3','24','0,5'],
      ['جدة','37,1','24,7','0,2'],
      ['الطائف','33,6','19,3','33,7'],
      ['الباحة','32,7','20','26,6'],
      ['أبها','28,8','15.1','26,3'],
      ['جازان','37,6','28,2','7,6'],
      ['نجران','37,2','21,5','8'],
      ['خميس \nمشيط','30,2','16,1','33,8'],
      ['شروره','40,8','24,3','3,8'],
      ['وادي \nالدواسر','41,2','25','3,6'],
      ['بيشة','37,4','21,5','12,9']
    ],
    'https://www.keepandshare.com/doc21/115404/pdf-75k?da=y'
    ],
    // 6 month
        [
   """•	٥ يونيو نهاية موسم الكنة (كنة الثريا)
•	٦ يونيو دخول موسم مربعانية القيظ
•	الأجواء جافة وتشتد الحرارة على مناطق الرياض القصيم حائل الشرقية تبوك الحدود الشمالية الجوف
•	موجات حر شديدة على سواحل منطقة مكة المدينة عند تحول الرياح لشمالية شرقية - جفاف الغدران – زوال عشب الربيع
•	نهاية موسم الأمطار فعلياً على أغلب مناطق المملكة الا ان يشاء الله    
•	تكون الأجواء على المرتفعات الجنوبية الغربية ومرتفعات جازان معتدلة مع سقوط الامطار الرعدية المتفرقة - تمتد أحيانا بعض السحب الممطرة شمالا الى منطقة مكة والمدينة المنورة 
•	اشتداد رياح البوارح الشمالية المغبرة المنطقة الشرقية منطقة الرياض الربع الخالي منطقة نجران شرق المرتفعات تطال المرتفعات والقصيم  
\u202E•	٥١ يونيو دخول موسم الغبرة على منطقة جازان رياح شمالية غربية تثير الغبار والسافي على الطرقات وسواحل وسط وجنوب البحر الأحمر ومكة الليث القنفذة وسط وجنوب البحر الأحمر تطال منطقة عسير والباحة 
•	(موسم غبار السودان) تكون موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر الليث القنفذة تمتد شمالا لجدة قادمة من السودان
•	رطوبة عالية على سواحل البحر الأحمر - رطوبة متوسطة الى مرتفعة على الأطراف الشمالية الغربية للمملكة 
\u202E•	١٢ يونيو (الانقلاب الصيفي) تعامد الشمس على مدار السرطان وهو أطول نهار في السنة 
\u202E•	٤٢ يونيو تنصرف الشمس ناحية الجنوب وبداية حر الانصراف (لا حر الا بعد انصراف) من بعد ١٢ يونيو تكون أطول أنهر السنة لمدة أسبوع تقريباً ويبدأ النهار بعدها بالقصر وبداية السموم طوال اليوم على معظم المناطق
•	انتظام حركة السحب من الشرق الى الغرب على النصف الجنوبي للجزيرة العربية  
    """,
    ['الصيف'],
    [
      'https://i.postimg.cc/rp03J4xc/summer-month.png',
      'https://i.postimg.cc/13PsdSpg/highest6.png',//'assets/images/highest6.png',
      'https://i.postimg.cc/SxqYfwRd/lowest6.png',//'assets/images/lowest6.png',
      'https://i.postimg.cc/52nyqyZ9/rain6.png',//'assets/images/rain6.png',
      0xffE3AC4A,
      0xffAF7E27,
    ],
    [
      ['مكة', '43,9', '28,9', '0'],
      ['المدينة', '42,9', '28.6', '0,1'],
      ['الرياض', '42,6', '25,5', '0'],
      ['الدمام', '43,6', '27,7', '0'],
      ['الاحساء', '44,6', '27,7', '0'],
      ['القيصومة', '43,4', '26,9', '0,1'],
      ['القصيم', '42,4', '25,2', '0'],
      ['حائل', '38,4', '22,2', '0,1'],
      ['رفحاء','41,4','24','0'],
      ['الجوف','38,5','23,2','0,1'],
      ['عرعر','39,8','23,7','0'],
      ['طريف','35,2','19,2','0'],
      ['القريات','37,3','18,2','0'],
      ['تبوك','37,9','22','0'],
      ['الوجه','33,2','23,8','0'],
      ['ينبع','40,4','25,3','0'],
      ['جدة','38,2','25,3','0'],
      ['الطائف','35,9','22,6','3,7'],
      ['الباحة','35,3','22,6','5,1'],
      ['أبها','31,1','16,9','7,3'],
      ['جازان','38,4','29,9','0,9'],
      ['نجران','39,1','22,8','2,7'],
      ['خميس \nمشيط','32,1','17,9','10,6'],
      ['شروره','42,5','25','3,8'],
      ['وادي \nالدواسر','43,6','26','0'],
      ['بيشة','39,6','23.2','2,4']
    ],
    'https://www.keepandshare.com/doc21/115409/pdf-74k?da=y'
    ],
    // 7 month
        [
    """• يشتد الحر والسموم والأجواء حارة جافة وهبائب وسموم على معظم المناطق 
•	تكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة الحرارة مع سقوط الامطار الرعدية الغزيرة تمتد الى سواحل جازان القنفذة الليث تمتد شمالاً لمنطقة مكة والمدينة – تطال الامطار أحيانا الربع الخالي الخرخير شروره نجران   أجزاء من منطقة الرياض (نادراً)
•	تكثر فيه السحب الكاتمة للجو المنطقة الوسطى والشرقية والربع الخالي - حركة السحب من الشرق للغرب على معظم المناطق   
•	استمرار رياح البوارح المغبرة (الشمالية) على الشرقية وشرق وشمال وجنوب منطقة الرياض وأجزاء من القصيم تطال الربع الخالي ومنطقة نجران وشرق المرتفعات 
•	استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) تطال مرتفعات عسير والباحة 
•	موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تطال مرتفعات عسير والباحة تمتد احياناً شمالا لسواحل منطقة المدينة قادمة من السودان 
•	(موسم غبار شرق السودان) 
•	رطوبة عالية على سواحل البحر الأحمر – رطوبة متوسطة على أقصى شمال المملكة – رطوبة محسوسة الى عالية المنطقة الشرقية موسم رطوبة الشرقية 
\u202E•	٤١ يوليو نهاية موسم مربعانية القيظ    - ٥١ يوليو دخول موسم جمرة القيظ    - ٥١ يوليو تعامد الشمس على الكعبة التعامد الثاني 
•	يشتد فيه الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق  
\u202E•	٧٢ يوليو تهدأ رياح البوارح ويخف الغبار على المنطقة الشرقية وشرق و منطقة الرياض    
    """,
    ['الصيف'],
    [
      'https://i.postimg.cc/rp03J4xc/summer-month.png',
      'https://i.postimg.cc/523bdr3s/highest7.png',//'assets/images/highest7.png',
      'https://i.postimg.cc/4dKY3G2f/lowest7.png',//'assets/images/lowest7.png',
      'https://i.postimg.cc/T1M3YDW0/rain7.png',//'assets/images/rain7.png',
      0xffE3AC4A,
      0xffAF7E27,
    ],
    [
      ['مكة', '43,2', '29,5', '1,2'],
      ['المدينة', '43,1', '29,6', '0,8'],
      ['الرياض', '43,8', '26,8', '0'],
      ['الدمام', '45,1', '29,5', '0'],
      ['الاحساء', '46', '29,7', '0'],
      ['القيصومة', '45', '28,6', '0'],
      ['القصيم', '43,6', '26,2', '0'],
      ['حائل', '39,5', '23,6', '0,1'],
      ['رفحاء','43','25,6','0'],
      ['الجوف','40,4','25','0'],
      ['عرعر','42,1','26','0'],
      ['طريف','37.5','21,3','0'],
      ['القريات','39,2','20,3','0'],
      ['تبوك','39,2','24','0'],
      ['الوجه','34,3','25,3','0'],
      ['ينبع','40,3','26,7','0'],
      ['جدة','39,4','27','0,4'],
      ['الطائف','35,4','23,5','1,8'],
      ['الباحة','35,4','23','10,4'],
      ['أبها','30,9','17,5','18,5'],
      ['جازان','38,4','30,4','12,1'],
      ['نجران','39,6','25,4','2,8'],
      ['خميس \nمشيط','32','18,3','22'],
      ['شروره','43,2','26,7','5,2'],
      ['وادي \nالدواسر','44,3','27,6','1,8'],
      ['بيشة','39,9','25','0,5']
    ],
    'https://www.keepandshare.com/doc21/115408/pdf-73k?da=y'
    ],
    // 8 month
        [
   """•	الأجواء حارة مع وصول الرطوبة للوسطى أحياناَ يشتد فيها الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق تكثر به السحب الكاتمة للجو على المنطقة الوسطى-الربع الخالي – الشرقية قد يسقط منها أحياناً أمطار رعدية متفرقة  
•	تشتد الرطوبة وتكون الضباب على سواحل البحر الأحمر - سواحل الخليج العربي – رطوبة عالية الحدود الشمالية الغربية    
•	تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد سقوط الامطار الرعدية تطال تهماتها الغربية - موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة وجنوب تبوك حركة السحب من الشرق الى الغرب على معظم المناطق
•	تهب فيه رياح السموم – يأتي فيه أحياناً موجات غبار كثيفه على مناطق الشرقية - الرياض وجنوبها تصل لنجران – المرتفعات وشرقها 
•	استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة مكة والمدينة قادمة من السودان 
•	٢٢ اغسطس نهاية جمرة القيظ   
\u202E•	٣٢ اغسطس دخول موسم سهيل   الأجواء حارة وسموم على معظم المناطق – بداية الإحساس بالرطوبة للمنطقة الوسطى - حركة السحب غير منتظمة وثقيلة   
•	الرطوبة عالية على سواحل الخليج العربي - سواحل البحر الأحمر رطوبة مرتفعة الحدود الشمالية الغربية  
•	نشاط عالي للرياح الشمالية على سواحل البحر الأحمر 
•	استمرار الرياح الشمالية المثيرة للغبار على   الشرقية الوسطى تطال شرق المرتفعات والمرتفعات
\u202E•	١٣ أغسطس نهاية موسم الغبرة بجازان سواحل منطقة مكة الليث القنفذة طريق الساحل - توثر أحياناً موجات غبار على سواحل وسط وجنوب البحر الأحمر تمتد شمالا لسواحل منطقة المدينة قادمة من السودان
    """,
    ['الصيف'],
    [
      'https://i.postimg.cc/rp03J4xc/summer-month.png',
      'https://i.postimg.cc/5N8fpyFd/highest8.png',//'assets/images/highest8.png',
      'https://i.postimg.cc/7LtCDhVt/lowest8.png',//'assets/images/lowest8.png',
      'https://i.postimg.cc/tRWgv2LM/rain8.png',//'assets/images/rain8.png',
      0xffE3AC4A,
      0xffAF7E27,
    ],
    [
      ['مكة', '42,9', '29,8', '5,2'],
      ['المدينة', '43,8', '30,3', '3,4'],
      ['الرياض', '43,7', '26,7', '0'],
      ['الدمام', '44,8', '28,9', '0'],
      ['الاحساء', '45,6', '29', '0'],
      ['القيصومة', '45,3', '28,7', '0,2'],
      ['القصيم', '44', '26,7', '0'],
      ['حائل', '40,3', '24,2', '0,1'],
      ['رفحاء','43,5','25,9','0'],
      ['الجوف','41','25,5','0,1'],
      ['عرعر','42.4','26,1','0'],
      ['طريف','37,8','21,6','0'],
      ['القريات','39,1','20,6','0'],
      ['تبوك','39,5','24,2','0,7'],
      ['الوجه','34,6','25,9','0'],
      ['ينبع','40,6','27,6','0,1'],
      ['جدة','38,6','28','0,6'],
      ['الطائف','35,9','23,8','16,6'],
      ['الباحة','35,6','23','11'],
      ['أبها','30,7','17','24,2'],
      ['جازان','38,1','29,8','24,7'],
      ['نجران','39,4','24,7','9,2'],
      ['خميس \nمشيط','31,9','17,8','26,4'],
      ['شروره','42,7','26,9','6,2'],
      ['وادي \nالدواسر','44,3','27,3','1,1'],
      ['بيشة','40','24,8','2,5']
    ],
    'https://www.keepandshare.com/doc21/115376/pdf-75k?da=y'
    ],
    // 9 month
        [
    """\u202E•	يتداخل فصلي الصيف والخريف في شهر سبتمبر ٨١ يوم من فصل الصيف ٢١ يوم من فصل الخريف
\u202E• ١ سبتمبر بداية تشغيل سخانات الماء وبداية التخفيف من درجة برودة التكييف فجراً على الوسطى الشمالية ومنطقة المدينة لبداية برودة الأجواء آخر الليل
\u202E• ٥ سبتمبر بداية انكسار شدة الحر نهاراً الأجواء حارة نهاراً على معظم المناطق وبداية الاعتدال ليلاً  
• الأجواء حارة طوال اليوم على معظم المناطق   معتدلة ليلاً على المناطق الشمالية لاتزال السحب غير منتظمة – رطوبة عالية على سواحل الخليج العربي - سواحل البحر الأحمر-رطوبة مرتفعة على الحدود الشمالية الغربية  
• تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد تساقط الامطار الرعدية تطال تهامتها الغربية – موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالاً لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة جنوب تبوك قد تمتد أحيانا الى الحدود الشمالية   
•	١٨ سبتمبر نهاية فصل الصيف محلياً
\u202E•	٩١ سبتمبر دخول فصل الخريف محلياً - انكسار شدة الحر
\u202E•	٠٢ سبتمبر دخول موسم الصفري بداية تغير الأجواء تكثر به أمراض الحساسية والزكام والانفلونزا
\u202E•	١٢ سبتمبر بداية نشاط الفترة الثانية لأعاصير ومنخفضات بحر العرب تنتهي ١٢ نوفمبر 
\u202E•	٣٢ سبتمبر (الاعتدال الخريفي فلكياً يكون في أحد الأيام التالية ٠٢-١٢-٢٢-٣٢ سبتمبر) تعامد الشمس على خط الاستواء 
\u202E•	٨٢ سبتمبر يتساوى طول الليل والنهار بعدها يأخذ الليل بالزيادة
•	الثلث الأخير من سبتمبر تكون الأجواء حارة نهاراً – تميل للاعتدال ليلاً والبرودة فجراً على معظم المناطق - حركة السحب غير منتظمة وثقيلة
•	رطوبة مرتفعة مع تكون الضباب على سواحل البحر الأحمر وسواحل الخليج العربي 
    """,
    ['الصيف', 'الخريف'],
    [
      'https://i.postimg.cc/rp03J4xc/summer-month.png',
      'https://i.postimg.cc/qBPk8yqx/highest9.png',//'assets/images/highest9.png',
      'https://i.postimg.cc/63Dy2PFd/lowest9.png',//'assets/images/lowest9.png',
      'https://i.postimg.cc/qMrvP2rM/rain9.png',//'assets/images/rain9.png',
      0xffE3AC4A,
      0xffAF7E27,
    ],
    [
      ['مكة', '44,2', '30', '5,6'],
      ['المدينة', '42,3', '28,3', '0.2'],
      ['الرياض', '40,7', '23,4', '0'],
      ['الدمام', '41,9', '25,6', '0'],
      ['الاحساء', '42,6', '25,6', '0'],
      ['القيصومة', '42,1', '25,3', '0'],
      ['القصيم', '41,4', '23,8', '0,1'],
      ['حائل', '38,1', '21,5', '0,1'],
      ['رفحاء','40,4','23,1','0'],
      ['الجوف','38,1','22,7','0,4'],
      ['عرعر','39','22,6','0'],
      ['طريف','34,7','18,8','0,2'],
      ['القريات','36,2','18,3','0,1'],
      ['تبوك','37,2','21,4','0'],
      ['الوجه','33,5','24,5','0,1'],
      ['ينبع','40','26,3','0'],
      ['جدة','37,4','26,9','0,1'],
      ['الطائف','35','21,1','10'],
      ['الباحة','33,7','21,4','2,4'],
      ['أبها','29,8','15,4','5,5'],
      ['جازان','38,2','28,9','9,9'],
      ['نجران','37','20,9','0,1'],
      ['خميس \nمشيط','30,6','16,4','3,5'],
      ['شروره','40,5','24','2,2'],
      ['وادي \nالدواسر','41,5','23,8','1,2'],
      ['بيشة','37,8','21','0']
    ],
    'https://www.keepandshare.com/doc21/115399/pdf-75k?da=y'
    ],
    // 10 month
        [
    """•	بداية أكتوبر بداية انصراف الحر ليلاٌ   
•	الأجواء حارة نهاراً - تميل للاعتدال ليلا وللبرودة فجرا على معظم المناطق – رطوبة عالية على سواحل الخليج وسواحل البحر الأحمر مع تكون الضباب على الشرقية والغربية رطوبة عالية المناطق الشمالية ورطوبة محسوسة على بقية المناطق 
•	تكون الاجواء على المرتفعات الجنوبية معتدلة مع سقوط الأمطار الرعدية – أمطار رعدية غزيرة على منطقة جازان تتركز على التهم تمتد الامطار الرعدية شمالاً لمنطقة مكة والمدينة
•	بداية منخفضات البحر المتوسط بداية حركة السحب من الغرب الى الشرق 
\u202E•	٥١ أكتوبر بداية (الوسم) الأجواء تميل للحرارة نهاراً تميل للبرودة ليلاً باردة فجراً وصباحاً على معظم المناطق بداية موسم أمطار الوسم المنبت للربيع وللفقع على مناطق المملكة إن الله أراد - المناطق الشمالية والغربية والمرتفعات وأجزاء من الوسطى وفي مواسم تتأخر أمطار الوسم للثلث الثاني - الثالث من الوسم  
•	انتظام حركة السحب من الغرب الى الشرق وقد يتأخر انتظام السحب أسبوع الى أسبوعين – السحب في أغلبها سحب عالية تتخللها سحب متوسطة - تتخللها فترات صحو طويلة على أغلب المناطق – تتأثر أجزاء من قطر بسحب رعدية غزيرة في هذه الفترة تكوينات محلية - رطوبة عالية على معظم المناطق تأتي فيه موجات غبار على الشرقية الوسطى       
\u202E• لازال موسم الصفري مستمر   تغير الأجواء تكثر به أمراض الحساسية والزكام والانفلونزا ونهايته في ٧٢ أكتوبر 
""",
    ['الخريف'],
    [
      'https://i.postimg.cc/QtK7C4p1/autumn-month.png',//'assets/images/autumn_month.png',
      'https://i.postimg.cc/Jhzm1QYM/highest10.png',//'assets/images/highest10.png',
      'https://i.postimg.cc/x8MqKRSB/lowest10.png',//'assets/images/lowest10.png',
      'https://i.postimg.cc/tCz4p7Rd/rain10.png',//'assets/images/rain10.png',
      0xffBB6B45,
      0xffBB6B45,
    ],
    [
      ['مكة', '41,9', '27', '11,5'],
      ['المدينة', '37,3', '23,3', '4,4'],
      ['الرياض', '35,5', '18,7', '1,3'],
      ['الدمام', '37,3', '21,6', '0,6'],
      ['الاحساء', '37,5', '21,1', '1,1'],
      ['القيصومة', '36,3', '20,5', '3,6'],
      ['القصيم', '35,9', '19', '2,9'],
      ['حائل', '32,6', '16,6', '6'],
      ['رفحاء','34,3','18,7','3,3'],
      ['الجوف','32','17,9','5,9'],
      ['عرعر','32,5','17,3','5'],
      ['طريف','28,9','14,4','6,2'],
      ['القريات','30,9','14,2','5,3'],
      ['تبوك','32,2','16,9','4.8'],
      ['الوجه','32,3','22,6','0,8'],
      ['ينبع','36,9','23,8','3,5'],
      ['جدة','36,4','24,6','1,2'],
      ['الطائف','30,9','16,1','15,3'],
      ['الباحة','29,6','16,8','7'],
      ['أبها','26,2','12,1','3,2'],
      ['جازان','36,7','26,6','17,8'],
      ['نجران','32,3','15,7','4'],
      ['خميس \nمشيط','27,2','13,2','4,2'],
      ['شروره','35,6','19,2','1,4'],
      ['وادي \nالدواسر','36,3','18,8','0,5'],
      ['بيشة','33,3','15,9','2']
    ],
    'https://www.keepandshare.com/doc21/115377/pdf-76k?da=y'
    ],
    // 11 month
        [
        
    """\u202E•	٢٢ يوم من فصل الخريف ٨ أيام من فصل الشتاء 
•	بداية نوفمبر تميل الأجواء نهاراً للاعتدال تميل للبرودة ليلاً باردة فجراً على معظم المناطق - رطوبة عالية على معظم المناطق
•	تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على مناطق المملكة 
•	نشاط للأعاصير والمنخفضات المدارية (بحر العرب) تؤثر على جنوب جزيرة العرب تعتبر هذه الفترة قليلة الامطار وإن أمر الله وأتت امطار تكون أمطار غزيرة وتشمل العديد من مناطق المملكة  
\u202E•	٠١ نوفمبر الأجواء رطبة على معظم المناطق ودرجات الحرارة معتدلة في النهار وتشتد البرودة ليلاً وصباحاً – بأمر الله الامطار فيه قليلة وإن أتت أمطار غالباً تكون الامطار غزيرة وشاملة للعديد من مناطق المملكة يصاحبها تكون الضباب وسحب النفيض لمناطق شمال ووسط وشرق المملكة 
•	بداية حالات الكسير على سواحل البحر الأحمر تشتد فيه الرياح على معظم المناطق - ارتفاع أمواج الخليج العربي والبحر الأحمر
\u202E•	٢٢ نوفمبر نهاية فصل الخريف محلياً
\u202E•	٣٢ نوفمبر دخول فصل الشتاء الأجواء رطبة وأجواء باردة في النهار ويشتد البرد ليلاً وصباحاً تنشط فيه الرياح السطحية - غالباً يأتي فيه أمطار وتكون الامطار غالباً غزيرة وشاملة للعديد من مناطق المملكة يصاحبها تكون الضباب وسحب النفيض لمناطق وسط وشرق وشمال المملكة بأمر الله   تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على مناطق المملكة   
•	أجواء تميل للاعتدال على سواحل وسط البحر الأحمر وسواحل جازان          
    """,

    ['الخريف', 'الشتاء'],
    [
      'https://i.postimg.cc/QtK7C4p1/autumn-month.png',//'assets/images/autumn_month.png',
      'https://i.postimg.cc/8CXGsrxW/highest11.png',//'assets/images/highest11.png',
      'https://i.postimg.cc/kMbV3ntw/lowest11.png',//'assets/images/lowest11.png',
      'https://i.postimg.cc/5tX4B3Bp/rain11.png',//'assets/images/rain11.png',
      0xffBB6B45, 
      0xffBB6B45,
    ],
    [
      ['مكة', '36,7', '24,4', '20,1'],
      ['المدينة', '30,4', '17,9', '13,6'],
      ['الرياض', '27,5', '13,4', '17'],
      ['الدمام', '28,7', '16,4', '21,1'],
      ['الاحساء', '29,4', '15,4', '11,6'],
      ['القيصومة', '26,2', '13', '26,3'],
      ['القصيم', '27,1', '13,2', '26,8'],
      ['حائل', '42,1', '10.4', '15,8'],
      ['رفحاء','24,3','11,3','16,5'],
      ['الجوف','23,2','10,9','11,1'],
      ['عرعر','23','10','10,3'],
      ['طريف','20,6','7,7','10,4'],
      ['القريات','23,2','7,9','10,3'],
      ['تبوك','25','10,8','4.1'],
      ['الوجه','30','19,1','9.2'],
      ['ينبع','33','19,7','11.3'],
      ['جدة','33,3','22,7','23,9'],
      ['الطائف','26,7','12,5','22.9'],
      ['الباحة','25,9','13','8'],
      ['أبها','23','9,4','5,9'],
      ['جازان','34,2','24,7','14.1'],
      ['نجران','28,4','12,5','1,5'],
      ['خميس \nمشيط','24,7','10,4','5,8'],
      ['شروره','31,2','15,1','0,7'],
      ['وادي \nالدواسر','30,6','14,7','1'],
      ['بيشة','29,6','12,6','6,1']
    ],
    'https://www.keepandshare.com/doc21/115406/pdf-77k?da=y'
    ],
    // 12 month
        [
    """•	بداية ديسمبر تشتد البرودة ليلاً وصباحاً والنهار بارد على معظم المناطق وأحيان تميل الأجواء للحرارة ظهراً – غالباً يأتي فيه أمطار على معظم المناطق ويتكون الضباب وسحب النفيض وسط وشمال وشرق المملكة – أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان
•	تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على بعض مناطق المملكة    
\u202E•	٦ ديسمبر دخول موسم المربعانية يذكر أن أول ٠١ أيام من المربعانية تعتبر وسم
\u202E•	١٢ ديسمبر الانقلاب الشتوي تعامد الشمس على مدار الجدي من بعدها تكون أطول الليالي خلال السنة لمدة أسبوع تقريباُ بعدها تنصرف الشمس باتجاه الشمال ويبدأ النهار بالزيادة على حساب الليل ويأتي برد الانصراف (لا برد الابعد انصراف) انصراف الشمس ناحية الشمال بداية اشتداد البرد 
•	تعمق المنخفضات القطبية فترة تساقط الثلوج على بلاد الشام تطال شمال المملكة احياناً
    """,
    ['الشتاء'],
    [
      'https://i.postimg.cc/CKzBrPrX/winter-month.png',
      'https://i.postimg.cc/FR2QVXrH/highest12.png',//'assets/images/highest12.png',
      'https://i.postimg.cc/N0n0SVsW/lowest12.png',//'assets/images/lowest12.png',
      'https://i.postimg.cc/t4CCTy7K/rain12.png',//'assets/images/rain12.png',
      0xff65A8AF,
      0xff257179,
      
    ],
    [
    ['مكة', '35,6', '21,8', '17,8'],
      ['المدينة', '26', '13,8', '6,6'],
      ['الرياض', '22.2', '8.8', '13,3'],
      ['الدمام', '23,2', '11,8', '17,4'],
      ['الاحساء', '23,6', '15,4', '11,6'],
      ['القيصومة', '20,2', '7,8', '17,5'],
      ['القصيم', '21,8', '8,4', '15,5'],
      ['حائل', '19,4', '5,6', '7,3'],
      ['رفحاء','18,8','6,4','9,9'],
      ['الجوف','17,9','5,9','9,1'],
      ['عرعر','17,5','5,2','8,7'],
      ['طريف','15,2','3,4','11,1'],
      ['القريات','17,7','3,5','9,5'],
      ['تبوك','19,9','5,9','4.17'],
      ['الوجه','26,7','15,8','8,65'],
      ['ينبع','29,6','16,2','10.7'],
      ['جدة','30,6','20,4','10,3'],
      ['الطائف','24','9,7','6,3'],
      ['الباحة','23,6','10,6','3,3'],
      ['أبها','21','7,7','3,6'],
      ['جازان','31,9','22,8','16,5'],
      ['نجران','26,1','9,6','0,73'],
      ['خميس \nمشيط','22,7','8,6','1.37'],
      ['شروره','27,7','11,5','1,35'],
      ['وادي \nالدواسر','26,2','10,7','0,73'],
      ['بيشة','26,8','9,6','1,95']
    ],
    'https://www.keepandshare.com/doc21/115398/pdf-72k?da=y'
    ],
  ];

}