
class SeasonsData{

} 
final List seasonsData = 
  [
  [ 'مدته ١٣١ يوم',
    ['assets/images/summer_back.png', 'assets/images/summer_char.png'],
    ['١١ مايو -',' ١٨ سبتمبر'],
    [12, 13, 0, 1, 2, 3, 4, 5],
    [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
    // titleColor, subColor, durationColor, zodiacTextColor, zodiacDataColor, darkBottonColor, lightBottonColor
    [0xffAF7E27, 0xffC9912E,  0xffC9912E, 0xffAA7516, 0xffB27201, 0xffD3A34F, 0xffE8C98C],
    ['assets/icons/summer_duration.png', 'assets/icons/summer_when.png'],

      """
\u202E• ١١ مايو يدخل فصل الصيف محلياً على وسط وشرق وغرب المملكة
\u202E• ٥١ مايو ترتفع الحرارة بشكل ملحوظ وتكون الأجواء حارة نهاراً معتدلة تميل للحرارة ليلاً على معظم المناطق ومعتدلة نهاراً باردة صباحاً على أقصى المناطق الشمالية والشمالية الغربية يأتي فيه موجات حر أحياناً على المناطق الشمالية
• تكون الأجواء معتدلة ممطرة على المرتفعات الجنوبية يصاحبها أمطار رعدية غزيرة تشمل الطائف وشرق المرتفعات وجازان
• بداية عدم انتظام حركة السحب وثقل حركتها يأتي فيه أمطار رعدية يصاحبها تساقط للبرد يصاحبها رياح هابطة مغبرة على مناطق الرياض القصيم حائل الشرقية الجوف الحدود الشمالية المدينة مكة السحب تمطر مكان نشأتها في الغالب
\u202E• ٠٢ مايو نهاية المنخفضات الخماسينية ومنخفضات البحر المتوسط
\u202E• ٣٢ مايو نهاية موسم السرايات على وسط وشمال وشرق المملكة مع استمرار فرص الأمطار بصورة ضعيفة مع كثرة الغبار المصاحب لها أجزاء من مناطق القصيم حائل منطقة الرياض خاصة غربها وفي بعض المواسم تمتد الامطار الى منطقة المدينة وتبوك في الغالب السحب تمطر مكان نشأتها
\u202E• ٤٢ مايو دخول موسم البوارح (نشاط الرياح الشمالية الجافة المثيرة للغبار والعوالق الترابية أثناء النهار) وتؤثر على الشرقية والوسطى تتركز شرق وجنوب منطقة الرياض تصل للربع الخالي ومنطقة نجران وشرق المرتفعات والمرتفعات تطال وبصورة اقل حائل والقصيم شرق الحدود الشمالية
• تسمى هذه الفترة بتويبع الوسمي «التويبع راعي بروق ومخاييل وما ذكر وادي من التويبع سال» بداية السباحة في البحر
• ٢٨ مايو تعامد الشمس على الكعبة التعامد الأول
• ٥ يونيو نهاية كنة الثريا
• ٦ يونيو دخول موسم مربعانية القيظ
• الأجواء جافة وتشتد الحرارة على مناطق الرياض القصيم حائل الشرقية تبوك الحدود الشمالية الجوف
• موجات حر شديدة على مناطق مكة والمدينة وسواحلها عند تحول الرياح لشمالية شرقية - جفاف الغدران – زوال عشب الربيع
• نهاية موسم الأمطار فعلياً على أغلب مناطق المملكة إلا ان يشاء الله    
• تكون الأجواء على المرتفعات الجنوبية الغربية ومرتفعات جازان معتدلة مع سقوط الامطار الرعدية المتفرقة - تمتد أحيانا بعض السحب الممطرة شمالا الى منطقة مكة والمدينة المنورة
• اشتداد رياح البوارح الشمالية المغبرة المنطقة الشرقية منطقة الرياض الربع الخالي منطقة نجران شرق المرتفعات تطال المرتفعات والقصيم
\u202E• ٥١ يونيو دخول موسم الغبرة على منطقة جازان رياح شمالية غربية تثير الغبار والسافي على الطرقات وسواحل وسط وجنوب البحر الأحمر ومكة الليث القنفذة وسط وجنوب البحر الأحمر تطال منطقة عسير والباحة
• (موسم غبار السودان) تكون موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر الليث القنفذة تمتد شمالا لجدة قادمة من السودان
• حركة السحب من الشرق الى الغرب على النصف الجنوبي للجزيرة العربية
• رطوبة عالية على سواحل البحر الأحمر - رطوبة متوسطة الى مرتفعة على الأطراف الشمالية الغربية للمملكة
\u202E• ١٢ يونيو (الانقلاب الصيفي) تعامد الشمس على مدار السرطان وهو أطول نهار في السنة 
\u202E• ٤٢ يونيو تنصرف الشمس ناحية الجنوب وبداية حر الانصراف (لا حر الا بعد انصراف) من بعد ١٢ يونيو تكون أطول الأنهر خلال السنة لمدة أسبوع تقريباً ويبدأ النهار بعدها بالقصر وبداية السموم طوال اليوم على معظم المناطق
• انتظام حركة السحب من الشرق الى الغرب على النصف الجنوبي للجزيرة العربية
• يشتد الحر والسموم الأجواء حارة جافة وهبائب وسموم على معظم المناطق
• تكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة الحرارة مع سقوط الامطار الرعدية الغزيرة تمتد الى سواحل جازان القنفذة الليث تمتد شمالاً لمنطقة مكة والمدينة
• استمرار رياح البوارح المغبرة (الشمالية) على الشرقية  و منطقة الرياض  وأجزاء من القصيم تطال الربع الخالي ومنطقة نجران وشرق المرتفعات
• استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) تطال مرتفعات عسير والباحة
• موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تطال مرتفعات عسير والباحة تمتد احياناً شمالا لسواحل منطقة المدينة قادمة من السودان
• (موسم غبار شرق السودان)
• رطوبة عالية على سواحل البحر الأحمر – رطوبة متوسطة على أقصى شمال المملكة
• ١٤ يوليو نهاية موسم مربعانية القيظ
\u202E• ٥١ يوليو دخول موسم جمرة القيظ - ٥١ يوليو تعامد الشمس على الكعبة التعامد الثاني
• يشتد فيه الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق - بداية موسم الرطوبة على المنطقة الشرقية – رطوبة عالية سواحل البحر الأحمر -رطوبة عالية أقصى المناطق الشمالية
\u202E• ٧٢ يوليو تهدأ رياح البوارح ويخف الغبار على المنطقة الشرقية وشرق وشمال وجنوب منطقة الرياض
• بداية أغسطس الأجواء حارة مع وصول الرطوبة للمنطقة الوسطى أحياناَ يشتد فيها الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق بداية تشكل السحب الكاتمة للجو على المنطقة الوسطى-الربع الخالي – الشرقية قد يسقط منها أحياناً أمطار رعدية متفرقة   - جفاف الآبار
• تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد سقوط الامطار الرعدية تطال تهماتها الغربية - موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة وجنوب تبوك
• تهب فيه رياح السموم – يأتي فيه أحياناً موجات غبار كثيفه على مناطق الشرقية - الرياض وجنوبها تصل لنجران
• استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة مكة والمدينة قادمة من السودان
• تشتد الرطوبة وتكون الضباب على سواحل البحر الأحمر - سواحل الخليج العربي تطال منطقة الرياض أحياناً – رطوبة عالية الحدود الشمالية الغربية
• ٢٢ اغسطس نهاية جمرة القيظ
\u202E• ٣٢ اغسطس دخول موسم سهيل   الأجواء حارة وسموم على معظم المناطق – بداية الإحساس بالرطوبة للمنطقة الوسطى - حركة السحب غير منتظمة وثقيلة   تهب فيه رياح شمالية مثيرة للغبار على مناطق الشرقية الرياض تطال شرق المرتفعات والمرتفعات وشرقها
• الرطوبة عالية على سواحل الخليج العربي - سواحل البحر الأحمر رطوبة مرتفعة الحدود الشمالية الغربية-نشاط عالي للرياح الشمالية على سواحل البحر الأحمر
\u202E• ١٣ أغسطس نهاية موسم الغبرة بجازان سواحل منطقة مكة الليث القنفذة طريق الساحل - توثر أحياناً موجات غبار على سواحل وسط وجنوب البحر الأحمر تمتد شمالاً لسواحل منطقة المدينة قادمة من السودان
\u202E• ١ سبتمبر بداية تشغيل سخانات الماء وبداية التخفيف من درجة برودة التكييف فجراً على الوسطى المناطق الشمالية ومنطقة المدينة لبداية برودة الأجواء آخر الليل
\u202E• ٥ سبتمبر بداية انكسار شدة الحر نهاراً الأجواء حارة نهاراً على معظم المناطق وبداية الاعتدال ليلاً
• الأجواء حارة طوال اليوم على معظم المناطق معتدلة ليلاً على المناطق الشمالية لاتزال السحب غير منتظمة – رطوبة عالية على سواحل الخليج العربي - سواحل البحر الأحمر-رطوبة مرتفعة على الحدود الشمالية الغربية
• تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد تساقط الامطار الرعدية تطال تاهمتها الغربية – موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة جنوب تبوك قد تمتد أحيانا الى الحدود الشمالية
"""
  
  ],

  [ 'مدته ٦٥ يوم',
    ['assets/images/autumn_back.png', 'assets/images/autumn_char.png'],
    ['١٩ سبتمبر -',' ٢٢ نوفمبر'],
    [5, 6, 7],
    [10, 11, 12, 13, 14],
    // titleColor, subColor, durationColor, zodiacTextColor, zodiacDataColor, darkBottonColor, lightBottonColor
    [0xffBB6B45, 0xffBD7148,  0xffA35530, 0xff964E2C, 0xff984D29, 0xffBB6B45, 0xffE2B07B],
    ['assets/icons/automn_duration.png', 'assets/icons/automn_when.png'],
    
  
"""\u202E• ٩١ سبتمبر دخول فصل الخريف محلياً – انكسار شدة الحر
\u202E• ٠٢ سبتمبر دخول موسم الصفري بداية تغير الأجواء تكثر به أمراض الحساسية والزكام والانفلونزا
\u202E• ١٢ سبتمبر بداية نشاط الفترة الثانية لأعاصير ومنخفضات بحر العرب تنتهي ١٢ نوفمبر
\u202E• ٣٢ سبتمبر (الاعتدال الخريفي فلكياً يكون في أحد الأيام التالية ٠٢-١٢-٢٢-٣٢ سبتمبر) تعامد الشمس على خط الاستواء
\u202E• ٨٢ سبتمبر يتساوى طول الليل والنهار بعدها يأخذ الليل بالزيادة
• الثلث الأخير من سبتمبر تكون الأجواء حارة نهاراً – تميل للاعتدال ليلاً والبرودة فجراً على معظم المناطق - حركة السحب غير منتظمة وثقيلة
• رطوبة مرتفعة مع تكون الضباب على سواحل البحر الأحمر وسواحل الخليج العربي
• بداية أكتوبر الأجواء حارة نهاراً - تميل للاعتدال ليلاً وللبرودة فجراً على معظم المناطق خاصة الأماكن المكشوفة – رطوبة عالية على سواحل الخليج وسواحل البحر الأحمر مع تكون الضباب رطوبة عالية المناطق الشمالية ورطوبة محسوسة على بقية المناطق 
• تكون الاجواء على المرتفعات الجنوبية معتدلة مع سقوط الأمطار الرعدية – أمطار رعدية غزيرة على منطقة جازان تتركز على التهم تمتد الامطار الرعدية شمالاً لمنطقة مكة والمدينة
• بداية منخفضات البحر المتوسط 
\u202E• ٥١ أكتوبر دخول موسم (الوسم) الأجواء تميل للحرارة نهاراً تميل للبرودة ليلاً باردة فجراً وصباحاً على معظم المناطق بداية موسم أمطار الوسم المنبت للربيع وللفقع على مناطق المملكة أن الله أراد - المناطق الشمالية والغربية والمرتفعات وأجزاء من الوسطى وفي مواسم تتأخر أمطار الوسم للثلث الثاني - الثالث من الوسم - بداية تجهيز الملابس الشتوية 
\u202E• لازال موسم الصفري مستمر، تغير الأجواء وانخفاض الحرارة تكثر به أمراض الحساسية والزكام والانفلونزا ونهايته في ٧٢ أكتوبر 
• انتظام حركة السحب من الغرب الى الشرق وقد يتأخر انتظام السحب أسبوع الى أسبوعين – السحب في أغلبها سحب عالية تتخللها سحب متوسطة - تتخللها فترات صحو طويلة على أغلب المناطق – تتأثر أجزاء من قطر بسحب رعدية غزيرة في هذه الفترة تكوينات محلية - رطوبة عالية على معظم المناطق – تأتي فيه موجات غبار على الشرقية الوسطى
\u202E• ٨٢ أكتوبر بداية لبس الملابس الشتوية ليلاً خاصة شمال المملكة
• بداية نوفمبر تميل الأجواء نهاراً للاعتدال تميل للبرودة ليلاً باردة فجراً على معظم المناطق - رطوبة عالية على معظم المناطق
• تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على مناطق المملكة
• تعتبر هذه الفترة قليلة الامطار وإن أمر الله وأتت امطار تكون أمطار غزيرة وتشمل العديد من مناطق المملكة
\u202E• ٠١ نوفمبر الأجواء رطبة على معظم المناطق ودرجات الحرارة معتدلة في النهار وتشتد البرودة ليلاً وصباحاً – بأمر الله الامطار فيه قليلة وإن أتت أمطار غالباً تكون الأمطار غزيرة وشاملة للعديد من مناطق المملكة يصاحبها تكون الضباب وسحب النفيض لمناطق شمال ووسط وشرق المملكة
• بداية حالات الكسير على سواحل البحر الأحمر (الأمطار الجبهية)
• تشتد فيه الرياح على معظم المناطق - ارتفاع أمواج الخليج العربي والبحر الأحمر
  """
  
  ],

    [ 'مدته ١٠٤ يوم',
    ['assets/images/winter_back.png', 'assets/images/winter_char.png'],
    ['٢٣ نوفمبر -',' ٦ مارس'],
    [7, 8, 9, 10],
    [15, 16, 17, 18, 19, 20, 21, 22],
    /// titleColor, subColor, durationColor, zodiacTextColor, zodiacDataColor, darkBottonColor, lightBottonColor
    [0xff257179, 0xff257179,  0xff459EA7, 0xff257179, 0xff9257179, 0xff65A8AF, 0xffABC7C9],
    ['assets/icons/winter_duration.png', 'assets/icons/winter_when.png'],

"""\u202E• ٣٢ نوفمبر دخول فصل الشتاء محلياً – لبس الملابس الشتوية
• الأجواء باردة في النهار ويشتد البرد ليلاً وصباحاً مع رطوبة محسوسة أجواء تميل للاعتدال على سواحل وسط البحر الأحمر وسواحل جازان  الثلث الأخير من نوفمبر غالباٌ يأتي فيه أمطار على معظم المناطق يأتي فيه موجات غبار قادمة من العراق وبادية الشام
\u202E• ٦ ديسمبر دخول موسم المربعانية تشتد فيه البرودة ليلاً وصباحاً والنهار بارد على معظم المناطق وأحيان تميل الأجواء للحرارة ظهراً – غالباً يأتي فيه أمطار على معظم المناطق ويتكون الضباب وسحب النفيض وسط وشمال وشرق المملكة - يذكر أن أول ٠١ أيام من المربعانية تعتبر وسم تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على بعض مناطق المملكة أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان
\u202E• ١٢ ديسمبر الانقلاب الشتوي تعامد الشمس على مدار الجدي من بعدها تكون أطول الليالي خلال السنة لمدة أسبوع تقريباُ بعدها تنصرف الشمس باتجاه الشمال ويبدأ النهار بالزيادة على حساب الليل ويأتي برد الانصراف (لا برد الابعد انصراف) انصراف الشمس ناحية الشمال وبداية اشتداد البرد - تعمق المنخفضات القطبية فترة تساقط الثلوج على بلاد الشام تطال شمال المملكة احياناً
• بداية يناير أبرد أيام السنة وشدتها على معظم مناطق المملكة ويتكون الصقيع خاصة في الأماكن المكشوفة البراري وتزداد الرطوبة على معظم المناطق ويتكون الضباب وسحب النفيض وترتفع الحرارة نهاراً أحياناً
• أمطاره عامة وديمية إن الله أراد على معظم المناطق أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان فترة تساقط الثلوج على المناطق الشمالية
\u202E• ٤١ يناير دخول موسم الشبط وفيه أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع خاصة في الأماكن المكشوفة البراري والمرتفعات
• فيه برد يسمى (برد الأزيرق) ويتكون فيه الضباب ترتفع فيه الحرارة نهاراً أحياناً
• يكثر به نشاط الرياح وتأتي فيه موجات غبار ويتكدر الجو   قليل الأمطار في الغالب أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان
• فترة تساقط الثلوج على المناطق الشمالية
\u202E• آخر ٣ أيام من يناير يوافق أيام (بذرة الست) وهي ٦ أيام صالحة لزراعة أي شي
\u202E• أول ٣ أيام من فبراير يوافق أيام (بذرة الست) وهي ٦ أيام صالحة لزراعة أي شيء فترة تساقط الثلوج على المناطق الشمالية
\u202E• أول ٠١ أيام من فبراير تعتبر ضمن أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع خاصة في الأماكن المكشوفة البراري والمرتفعات
• ترتفع الحرارة أحياناً نهاراً - يتكون فيه الضباب
• ٨ فبراير نهاية موسم الشبط
• ٩ فبراير دخول موسم العقارب
الأجواء لاتزال باردة على معظم المناطق يأتي فيه أيام دفء تعقبها موجة برد وبرده شديد يتكون فيه الضباب - تقل فيه الأمطار على معظم المناطق وتكون أمطاره غزيرة في مواسم قليلة أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل
• تنشط فيه الرياح والأجواء تكون متكدرة يأتي فيه موجات غبار على مناطق المملكة
• نهاية حالات الكسير على سواحل البحر الأحمر
\u202E• ٢٢ فبراير الأجواء لازالت باردة على معظم المناطق وبداية انكسار موجة البرد الأجواء باردة صباحاً تميل للإعتدال والحرارة ظهراً يأتي فيه برد بعد موجة دفء يسمى (برد العجوز) نهاية موسم تساقط الثلوج على المناطق الشمالية
"""
  
  ],

      [ 'مدته ٦٥ يوم',
    ['assets/images/spring_back.png', 'assets/images/spring_char.png'],
    ['٧ مارس -',' ١٠ مايو'],
    [10, 11, 12, 13],
    [23, 24, 25, 26, 27],
    /// titleColor, subColor, durationColor, zodiacTextColor, zodiacDataColor, darkBottonColor, lightBottonColor
    [0xff4E5A33, 0xff6C7D47,  0xff6C7D47, 0xff4E5A33, 0xff4E5A33, 0xff6C7D47, 0xffB6CF94],
    ['assets/icons/spring_duration.png', 'assets/icons/spring_when.png'],

  
"""\u202E• ٧ مارس دخول فصل الربيع محلياً الأجواء باردة صباحا ًتميل للاعتدال والحرارة ظهراً ويأتي فيه برد بعد دفء (برد بياع الخبل عباته) وتحدث فيه تقلبات جوية وأمطار وتنشط فيه الرياح المثيرة للغبار وتكدر الأجواء على المنطقة الوسطى والشرقية والشمالية أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان
• التخفيف من الملابس الشتوية واخراج الملابس الربيعية لمعظم المناطق
• ١٩ مارس نهاية موسم العقارب
\u202E• ٠٢ مارس دخول موسم الحميمين وبداية موسم سبق السرايات أمطار الربيع (مراويح الصيف) الأجواء فيه متقلبة أمطار تساقط البرد شدة الرياح مثيرة للغبار تفاوت في درجات الحرارة بين ارتفاع وانخفاض، تمييل الأجواء للإعتدال صباحاً وترتفع الحرارة نهاراً على الوسطى والشرقية والغربية وتميل للبرودة صباحاً وليلاً على المناطق الشمالية والمرتفعات الجنوبية الغربية
• يأتي فيه احياناً برد يهلك الزرع يسمى (برد الحميمين) على الوسطى والشمالية تكثر به أمراض الحساسية والزكام
\u202E• ١٢-٢٢ مارس الاعتدال الربيعي تعامد الشمس على خط الاستواء يتساوى فيه الليل والنهار ويبدأ النهار بالزيادة
\u202E• ١٢ بداية تأثير المنخفضات الخماسينية على المملكة مصدرها الصحراء الكبرى بأفريقيا
• (نشاط عالي للرياح السطحية المثيرة للغبار وارتفاع في درجات الحرارة يليه انخفاض على معظم المناطق) تكثر به أمراض الحساسية والزكام
\u202E• ٥١ ابريل بداية موسم السرايات أمطار الربيع (مراويح الصيف) الأجواء بمشيئة الله تميل للحرارة نهاراً معتدلة صباحاً وليلاً فيه تقلبات الأجواء تكون شديدة سقوط الامطار وتساقط البرد وهبوب العواصف والرياح الهابطة المثيرة للغبار وتشكل موجات غبار كثيفة على مناطق الرياض القصيم حائل الشرقية الشمالية مكة المدينة نجران المرتفعات وشرق المرتفعات اخراج الملابس الصيفة
\u202E• ١٢ أبريل بداية نشاط الفترة الأولى لأعاصير ومنخفضات بحر العرب تنتهي ١٢ يونيو
• ٢٨ أبريل دخول موسم الكنة (كنة الثريا)
• في آخره يأتي فيه موجات برد على المناطق الشمالية وحائل تصل أحياناً الى منطقة القصيم والرياض
\u202E• وتستمر تقلبات الأجواء الى خروج فصل الربيع محلياً ١١ مايو
 """
  ],
  ];