class ZodiacsData{


  static final List zodiacData = [
    [
      "البوارح",
      """رياح البوارح رياح شمالية غربية قادمة من بلاد الشام تتحول لشمالية شرقية مع دخولها أجواء المملكة رياح حارة جافة مثيرة للغبار والعواصف الجدارية الغبارية احياناً
• مدتها ٦٥ يوم تبدأ ٢٤ مايو – تنتهي ٢٧ يوليو
\u202E• تتكون من ٥ طوالع طالع البطين ٣١ يوم - طالع الثريا ٣١ يوم - طالع الدبران ٣١ يوم - طالع الهقعة ٣١ يوم - طالع الهنعة ٣١ يوم
• سبب حدوثها
ضغط سطحي مرتفع شرق البحر المتوسط يقابله ضغط سطحي منخفض على الخليج العربي وشرق الجزيرة العربية والربع الخالي مما يجعل الرياح تنحدر من الشمال الشرقي للجزيرة العربية الى الجنوب الغربي
• فترة نشاطها الفعلي
\u202Eما بين ٤٢ مايو إلى ٧٢ يوليو وتكون على شكل موجات تنشط على فترات وتختلف قوتها من موسم إلى موسم تتقدم في مواسم وتتأخر في مواسم وتنشط الرياح خلال اليوم فترة الضحى وتهدأ مع المغرب والغبار يبقى إلى منتصف الليل وأحياناً إلى صباح اليوم التالي وتستمر بعض الموجات أحياناً عدة أيام تصل سرعتها ما بين ٠٢ كم إلى ٠٧ كلم
• ٢٨ مايو (تعامد الشمس على الكعبة التعامد الأول)
• المناطق المتأثرة بها
المنطقة الشرقية للمملكة ومنطقة الرياض خاصة شمالها وشرقها وجنوبها منطقة نجران وشرق المرتفعات ومرتفعات عسير والباحة وتطال القصيم وحائل أحياناَ""",

      'assets/images/zodiac_summer_back.png',
      0xffE3AC4A,
    ],
    [
      "مربعانية القيظ",
      """بداية الصيف الحار على معظم مناطق المملكة 

• مدتها:
\u202E٩٣ يوم  تبدأ ٦ يونيو - تنتهي ٤١ يوليو تتكون من ٣ طوالع طالع الثريا ٣١ يوم - طالع الدبران ٣١ يوم طالع الهقعة ٣١ يوم 

• خصائصها:
الأجواء جافة وتشتد الحرارة على مناطق الرياض القصيم حائل الشرقية المدينة مكة الجوف تبوك الحدود الشمالية نهاية موسم الأمطار فعلياً على أغلب مناطق المملكة الا ان يشاء الله تكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة مع سقوط الأمطار الرعدية
•	انتظام حركة السحب من الشرق الى الغرب على النصف الجنوبي للجزيرة العربية - رطوبة عالية على سواحل البحر الأحمر- رطوبة متوسطة الى مرتفعة على الأطراف الشمالية الغربية للمملكة
\u202E•	١٢ يونيو (الانقلاب الصيفي) تتعامد الشمس على مدار السرطان وهو أطول نهار في السنة - ٤٢ يونيو تنصرف الشمس ناحية الجنوب بداية حر الانصراف (لا حر الا بعد انصراف) ويبدأ الليل بالزيادة
•	الأجواء جافة حارة وبداية السموم طوال اليوم على معظم المناطق – موجات حر شديدة على سواحل منطقة مكة والمدينة عند تحول الرياح لشمالية شرقية جافة
•	تكون الأجواء على المرتفعات الجنوبية الغربية ومرتفعات جازان معتدلة مع سقوط الامطار الرعدية المتفرقة - تمتد أحيانا بعض السحب الممطرة شمالا الى المدينة المنورة
•	اشتداد رياح البوارح الشمالية المغبرة المنطقة الشرقة منطقة الرياض أجزاء من القصيم تصل لمنطقة نجران شرق المرتفعات - استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد شمالا احياناً قادمة من السودان رطوبة عالية على سواحل البحر الأحمر - رطوبة متوسطة الى مرتفعة على الأطراف الشمالية الغربية للمملكة
\u202E•	٨٢ يونيو الى ٧ يوليو يكون وقت غروب الشمس واذان صلاة العشاء قد بلغا اقصى مدى لهما بالتأخر طوال العام جفاف الغدران – زوال عشب الربيع
\u202E•	٢ يوليو يشتد الحر والسموم – الأجواء حارة جافة وهبائب وسموم على معظم المناطق وتكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة الحرارة مع سقوط الامطار الرعدية الغزيرة تمتد الى سواحل جازان القنفذة الليث – تطال الامطار أحيانا الربع الخالي الخرخير شروره نجران
•	رطوبة عالية على سواحل البحر الأحمر – رطوبة متوسطة على أقصى شمال المملكة – رطوبة محسوسة الى عالية المنطقة الشرقية
•	استمرار رياح البوارح المغبرة (الشمالية) على الشرقية وشرق وشمال وجنوب منطقة الرياض وأجزاء من القصيم تصل لمنطقة نجران وشرق المرتفعات -استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) - موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدينة قادمة من السودان (موسم غبار شرق السودان)
\u202E•	(٤١ يوليو نهاية موسم مربعانية القيظ) - حركة السحب من الشرق الي الغرب على مناطق المملكة""",

    'assets/images/zodiac_summer_back.png',
    0xffE3AC4A,

    ],
    [
      "الغبرة",
      """رياح شمالية غربية نشطة مثيرة للغبار والسافي على الطرقات تشل أحياناً الملاحة البحرية والجوية والبرية وتتسبب بالعديد من الحوادث وقطع التيار الكهربائي على سواحل البحر الأحمر الجنوبية
\u202E• مدتها: ٨٧ يوم تتكون من ٧ طوالع   طالع الثريا ٤ أيام - طالع الدبران ٣١ يوم - طالع الهقعة ٣١ يوم طالع- الهنعة ٣١ يوم - طالع المرزم ٣١ يوم - طالع الكليبين ٣١ يوم - طالع الطرف ٩ أيام 
• سبب حدوثها: ارتفاع الضغط الجوي شمال الجزيرة العربية وانخفاض الضغط الجوي على البحر الأحمر
\u202E• فترة نشاطها: من ٥١ يونيو من كل عام تقريباً تتقدم تتأخر أحياناً تستمر الى ١٣ أغسطس 

موسم الغبرة ينقسم إلى قسمين
\u202E١)	مغبر جاف قليل الأمطار ويكون خلال الفترة ٥١ يونيو إلى ٠٢ يوليو
٢)	مغبر رطب ممطر ويكون خلال الفترة ٢٠يوليو إلى ١٣ أغسطس
موسم غبار السودان\n يصادف وقت موسم غبرة جازان موسم غبار السودان حيث يزحف الغبار من الأراضي السودانية باتجاه منطقة جازان ووسط البحر الأحمر يمتد شمالاً أحياناً إلى سواحل المدينة المنورة
•	المناطق المتأثرة بها \n عموم منطقة جازان سواحل عسير وسواحل منطقة مكة الليث القنفذة طريق الساحل تطال المرتفعات وتمتد شمالاً لسواحل المدينة أحياناً ووسط وجنوب مياه البحر الأحمر   قادمة من السودان
      """,
            'assets/images/zodiac_summer_back.png',
            0xffE3AC4A,
      
    ],
    ["الجوزاء", 
      """شدة الحر وجفاف الأجواء

مدتها:
\u202Eتستمر لمدة ٦٢ يوم تبدأ ٢ يوليو - تنتهي ٧٢ يوليو وتتكون من نجمين الهقعة ٣١ يوم - الهنعة ٣١ يوم 

خصائصها:
•	يشتد الحر والسموم – الأجواء حارة جافة وهبائب وسموم على معظم المناطق - الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة الحرارة مع سقوط الامطار الرعدية الغزيرة تمتد الى سواحل جازان القنفذة الليث   – تطال الامطار أحيانا الربع الخالي الخرخير شروره نجران - رطوبة عالية على سواحل البحر الأحمر – رطوبة متوسطة على أقصى شمال المملكة – رطوبة محسوسة الى عالية المنطقة الشرقية
•	استمرار رياح البوارح المغبرة (الشمالية) على الشرقية وشرق وشمال وجنوب منطقة الرياض وأجزاء من القصيم تصل لمنطقة نجران وشرق المرتفعات -استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) - موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدينة قادمة من السودان (موسم غبار شرق السودان)
\u202E•	(٤١ يوليو نهاية موسم مربعانية القيظ) - حركة السحب من الشرق الى الغرب على مناطق المملكة
\u202E•	٥١ يوليو بداية موسم جمرة القيظ – ٥١ يوليو تعامد الشمس على الكعبة   التعامد الثاني
•	يشتد فيه الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق
•  تكثر فيه السحب الكاتمة للجو المنطقة الوسطى – الربع الخالي - الشرقية يهطل منها أمطار رعدية متفرقة نادراَ
•	تكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة مع سقوط الامطار الرعدية تكون غزيرة وشاملة تمتد الى سواحل القنفذة الليث بداية موسم الامطار على منطقة جازان تمتد شمالاً لمنطقة مكة والمدينة 
•	حركة السحب من الشرق للغرب على معظم المناطق 
•	استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدية قادمة من السودان بداية موسم الرطوبة على المنطقة الشرقية – رطوبة عالية سواحل البحر الأحمر رطوبة عالية كذلك اقصى الحدود الشمالية الغربية 
\u202E•	٧٢ يوليو تهدأ رياح البوارح ويخف الغبار على المنطقة الشرقية وشرق وشمال وجنوب منطقة الرياض """,


      'assets/images/zodiac_summer_back.png',
      0xffE3AC4A,

    ],
    ["جمرة القيظ", 
      """شدة الحر وجفاف الأجواء
\u202E•	مدتها: ٩٣ يوم تبدأ ١٥ يوليو - تنتهي ٢٢ أغسطس   تتكون من ٣ طوالع  الهنعة ٣١ يوم - الذراع ٣١ يوم - النثرة ٣١ يوم
•	خصائصها: 
\u202E•	١٥ يوليو بداية موسم جمرة القيظ   – ١٥ يوليو تعامد الشمس على الكعبة التعامد الثاني
•	يشتد فيه الحر والسموم طوال اليوم حتى منتصف الليل على معظم المناطق   تكثر فيه السحب الكاتمة للجو المنطقة الوسطى – الربع الخالي - الشرقية نادراً يهطل منها أمطار رعدية متفرقة
•	تكون الاجواء على المرتفعات الجنوبية ومرتفعات جازان معتدلة مع سقوط الامطار الرعدية تكون غزيرة وشاملة تمتد الى سواحل القنفذة الليث بداية موسم الامطار على منطقة جازان تمتد شمالاً لمنطقة مكة والمدينة
•	حركة السحب من الشرق للغرب على معظم المناطق استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدية قادمة من السودان بداية موسم الرطوبة على المنطقة الشرقية – رطوبة عالية سواحل البحر الأحمر رطوبة عالية كذلك اقصى الحدود الشمالية الغربية
\u202E•	٧٢ يوليو تهدأ رياح البوارح ويخف الغبار على المنطقة الشرقية وشرق وشمال وجنوب منطقة الرياض
\u202E•	٨٢ يوليو الأجواء جافة يشتد فيها الحر تهب فيه رياح السموم طوال اليوم حتى منتصف الليل على معظم المناطق
•	تكثر به السحب الكاتمة للجو على المنطقة الوسطى-الربع الخالي – الشرقية قد يسقط منها أحياناً أمطار رعدية متفرقة وتكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد سقوط الامطار الرعدية تطال تهامتها الغربية - موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة وتبوك تطال الأمطار نادراً أجزاء من مناطق حائل القصيم الرياض
•	تشتد الرطوبة وتكون الضباب على سواحل البحر الأحمر - سواحل الخليج العربي – رطوبة عالية الحدود الشمالية الغربية
•	 حركة السحب من الشرق للغرب على معظم المناطق
•	يأتي فيه أحياناً موجات غبار كثيفه على مناطق الشرقية - الرياض وجنوبها تصل لنجران - استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدينة قادمة من السودان
\u202E•	٠١ اغسطس   شدة الحر والسموم طوال اليوم على معظم المناطق -  تكثر به السحب الكاتمة للجو القادمة من الشرق وتكون حركة السحب ثقيلة وغير منتظمة تكتم الجو قد يأتي منها أحياناً أمطار رعدية متفرقة وسط وشرق المملكة والربع الخالي و تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد الامطار الرعدية تطال تهامتها الغربية – موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة جنوب تبوك – رطوبة عالية سواحل البحر الأحمر الحدود الشمالية - سواحل الخليج العربي
• جفاف الابار
•	استمرار موسم الغبرة على منطقة جازان سواحل منطقة مكة الليث القنفذة (طريق الساحل) موجات غبار تؤثر على سواحل وسط وجنوب البحر الأحمر تمتد احياناً شمالا لسواحل منطقة المدية قادمة من السودان
•	٢٢ اغسطس نهاية جمرة القيظ""",
      'assets/images/zodiac_summer_back.png',
      0xffE3AC4A,


    ],

    ["سهيل", 
      """نجم يشاهد في الأفق الجنوبي الشرقي للمملكة لا علاقة له بتغير الأجواء هو فقط علامة وحساب لمعرفة تغير الأجواء
\u202E•	مدته: ٣٥ يوم ويتكون من ٤ طوالع - الطرف ٣١ يوم – الجبهة ٤١ يوم – الزبرة ٣١ يوم – الصرفة ٣١ يوم
•	وقت ظهوره: يختلف وقت ظهوره من منطقة لمنطقة  فيظهر في المناطق الجنوبية أولاً ثم الوسطى ثم الشمالية 
•	٢٣اغسطس دخول موسم سهيل على أفق سدير  
•	خصائصه:
•	الأجواء حارة وسموم على معظم المناطق –  و تكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد الامطار الرعدية تطال تهامتها الغربية – موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية لمنطقة نجران كذلك تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة جنوب تبوك  - بداية الإحساس بالرطوبة للمنطقة الوسطى - حركة السحب غير منتظمة وثقيلة –  الرطوبة عالية مع تكون الضباب على سواحل الخليج العربي - سواحل البحر الأحمر رطوبة مرتفعة الحدود الشمالية الغربية   - نشاط عالي للرياح الشمالية على سواحل البحر الأحمر
\u202E•	١٣ أغسطس نهاية موسم الغبرة بجازان سواحل منطقة مكة الليث القنفذة طريق الساحل - توثر أحياناً موجات غبار على سواحل وسط وجنوب البحر الأحمر تمتد شمالا لسواحل منطقة المدينة قادمة من السودان
\u202E•	١ سبتمبر بداية تشغيل سخانات الماء وبداية التخفيف من درجة برودة التكييف فجراً    على الوسطى الشمالية ومنطقة المدينة
\u202E•	٥ سبتمبر بداية انكسار شدة الحر الأجواء حارة طوال اليوم مع بداية اعتدالها ليلاً على معظم المناطق معتدلة تميل للبرودة ليلاً على المناطق الشمالية وتكون الأجواء على المرتفعات الجنوبية الغربية معتدلة مع ازدياد تساقط الامطار الرعدية تطال تهامتها الغربية – موسم أمطار منطقة جازان (سحب استوائية) تمتد شمالا لسواحل القنفذة الليث تمتد الامطار الرعدية شمالاً الى منطقة مكة والمدينة جنوب تبوك قد تمتد أحيانا الى الحدود الشمالية
•	لاتزال حركة السحب غير منتظمة – رطوبة عالية على سواحل الخليج العربي - سواحل البحر الأحمر-رطوبة مرتفعة على الحدود الشمالية الغربية
\u202E•	٥١ سبتمبر التخفيف من درجة برودة التكييف ليلاً وفجرا الوسطى الشمالية ومنطقة المدينة - تشغيل سخانات الماء فجراً الوسطى الشمالية ومنطقة المدينة
•	١٨ سبتمبر نهاية فصل الصيف محلياً 
\u202E•	٩١ سبتمبر دخول فصل الخريف - انكسار شدة الحر لا تزال الأجواء حارة نهاراً – تميل للاعتدال ليلاً والبرودة فجراً على معظم المناطق وتكون الاجواء على المرتفعات الجنوبية معتدلة مع سقوط الأمطار الرعدية – أمطار على منطقة جازان تمتد شمالا لسواحل القنفذة الليث - تمتد الامطار الرعدية شمالاً لمنطقة مكة والمدينة
\u202E•	٠٢ سبتمبر بداية موسم الصفري بداية تغير الأجواء تكثر به أمراض الحساسية والزكام والانفلونزا
\u202E•	١٢ سبتمبر بداية نشاط الفترة الثانية لأعاصير ومنخفضات بحر العرب تنتهي ١٢ نوفمبر 
•	رطوبة مرتفعة مع تكون الضباب على سواحل البحر الأحمر وسواحل الخليج العربي
\u202E•	٣٢ سبتمبر (الاعتدال الخريفي فلكياً يكون في أحد الأيام ٠٢-١٢-٢٢-٣٢ سبتمبر) تعامد الشمس على خط الاستواء
\u202E•	٨٢ سبتمبر يتساوى طول الليل والنهار بعدها يأخذ الليل بالزيادة- حركة السحب غير منتظمة وثقيلة
\u202E•	٢ أكتوبر انصراف الحر ليلاً الأجواء حارة نهاراً - تميل للاعتدال ليلا وللبرودة فجرا على معظم المناطق – الاجواء على المرتفعات الجنوبية معتدلة مع سقوط الأمطار الرعدية – أمطار رعدية غزيرة على منطقة جازان تتركز على التهم تمتد الامطار الرعدية شمالاً لمنطقة مكة والمدينة رطوبة عالية على سواحل الخليج وسواحل البحر الأحمر مع تكون الضباب رطوبة عالية المناطق الشمالية ورطوبة محسوسة على بقية المناطق
•	بداية منخفضات البحر المتوسط    - بداية حركة السحب من الغرب الى الشرق منتصف أكتوبر تتقدم وتتأخر حسب الموسم
•	منتصف موسم الصفري تغير الأجواء تكثر به أمراض الحساسية والزكام والانفلونزا - التخفيف من درجة برودة التكييف ليلاً وفجرا الوسطى الشمالية ومنطقة المدينة
•	١٤ أكتوبر نهاية موسم سهيل """,
      'assets/images/zodiac_summer_back.png',
      0xffE3AC4A,

    ],

    ["الصفري", 
    """\u202Eفترة انتقالية من فصل الصيف الى فصل الخريف يبدأ ٠٢ سبتمبر - ينتهي ٧٢ أكتوبر
\u202E• مدته: ٩٣ يوم يتكون موسم الصفري من ٣ طوالع - الزبرة ٣١ يوم - الصرفة ٣١ يوم - العواء ٣١ يوم
• خصائصه :
• بدايتة تنكسر فيه حدة الحر نهاراً تعتدل الأجواء ليلاً وتبرد فجراً
\u202E•	١٢ سبتمبر بداية نشاط الفترة الثانية لأعاصير ومنخفضات بحر العرب تنتهي ١٢ نوفمبر
\u202E•	٣٢ سبتمبر (الاعتدال الخريفي فلكياً يكون في أحد الأيام التالية ٠٢-١٢-٢٢-٣٢ سبتمبر) تعامد الشمس على خط الاستواء
\u202E•	٨٢ سبتمبر يتساوى فيه طول الليل والنهار بعدها يأخذ الليل بالزيادة
•	الثلث الأخير من سبتمبر تكون الأجواء حارة نهاراً – تميل للاعتدال ليلاً والبرودة فجراً على معظم المناطق - حركة السحب غير منتظمة وثقيلة
•	رطوبة مرتفعة مع تكون الضباب على سواحل البحر الأحمر وسواحل الخليج العربي بداية يكره فيه السباحة في البحر وينتهي فيه موسم الغوص كذلك السباحة في المسابح
•	تكثر به أمراض الانفلونزا والزكام والحساسية - تجنب شرب الماء البارد
•	التخفيف من برودة التكييف – الحرص على فتح شبابيك البيت لتغيير جو البيت خاصة ليلاً - بداية تشغيل سخانات الماء لبرودة الماء فجراً
•	بداية منخفضات البحر المتوسط 
•	منتصف أكتوبر يدخل الوسم وتتحرك السحب من الغرب الى الشرق وقد تتقدم وقد تتأخر تحرك السحب من الغرب الى الشرق
•	في نهايته تبرد الأجواء نهاراً """,
      'assets/images/zodiac_automn_back.png',
      0xffBB6B45, 

    ],

    ["الوسم", 
      """موسم الامطار على الجزيرة العربية المنبت للفقع والربيع

•	مدته: ٢٥ يوم   ويتكون من ٤ طوالع
\u202Eالعواء ٣١ يوم – السماك ٣١ يوم – الغفر ٣١ يوم – الزبانا ٣١ يوم 

•	خصائصه:
•	بداية منخفضات البحر المتوسط
\u202E•	٥١ أكتوبر بداية (الوسم) الأجواء تميل للحرارة نهاراً تميل للبرودة ليلاً باردة فجراً وصباحاً على معظم المناطق بداية موسم أمطار الوسم المنبت للربيع والفقع على مناطق المملكة أن الله أراد - المناطق الشمالية والغربية والمرتفعات وأجزاء من الوسطى وفي مواسم تتأخر أمطار الوسم للثلث الثاني - الثالث من الوسم
• انتظام حركة السحب من الغرب الى الشرق – السحب في أغلبها سحب عالية تتخللها سحب متوسطة --- تتخللها فترات صحو طويلة على أغلب المناطق – تتأثر أجزاء من قطر بسحب رعدية غزيرة في هذه الفترة تكوينات محلية - رطوبة عالية على معظم المناطق
•	 تأتي فيه موجات غبار على الشرقية الوسطى 
\u202E• ٧٢ أكتوبر نهاية موسم الصفري   بداية تجهيز الملابس الشتوية
\u202E•	٧٢ أكتوبر - 5نوفمبر يوافق أبكر مدى للتقدم لوقت اذان الظهر طوال العام
\u202E•	٨٢ أكتوبر تميل الأجواء نهاراً للاعتدال وتميل للبرودة ليلاً وباردة فجراً على معظم المناطق - رطوبة عالية على معظم المناطق تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على مناطق المملكة
•	نشاط للأعاصير والمنخفضات المدارية (بحر العرب) تؤثر على جنوب جزيرة العرب
•	تعتبر هذه الفترة قليلة الامطار وأن أمر الله وأتت امطار تكون أمطار غزيرة وتشمل العديد من مناطق المملكة   بداية لبس الملابس الشتوية ليلاً
\u202E•	٢٢ نوفمبر نهاية فصل الخريف محلياً الأجواء معتدلة رطبة على معظم المناطق نهاراَ وتشتد البرودة ليلاً وصباحاً – بأمر الله الامطار فيه قليلة وإن أتت أمطار غالباً تكون الامطار غزيرة وشاملة للعديد من مناطق المملكة يصاحبها تكون الضباب وسحب النفيض لمناطق شمال ووسط وشرق المملكة - تشتد فيه الرياح على معظم المناطق - ارتفاع أمواج الخليج العربي والبحر الأحمر 
•	بداية حالات الكسير على سواحل البحر الأحمر (أمطار رعدية غزيرة جبهية) 
\u202E•	٣٢ نوفمبر دخول فصل الشتاء محلياً الأجواء باردة رطبة في النهار ويشتد البرد ليلاً وصباحاً تنشط فيه الرياح السطحية على معظم المناطق - أجواء تميل للاعتدال على سواحل وسط البحر الأحمر وسواحل جازان
•	غالباً يأتي فيه أمطار وتكون الامطار غزيرة وشاملة للعديد من مناطق المملكة يصاحبها تكون الضباب وسحب النفيض لمناطق وسط وشرق وشمال المملكة
•	بأمر الله تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على مناطق المملكة لبس الملابس الشتوية لمعظم مناطق المملكة
•	٥ ديسمبر نهاية موسم الوسم""",
      'assets/images/zodiac_automn_back.png',
      0xffBB6B45,

    ],

    ["المربعانية", 
      """برودة الأجواء واشتداد البرد

\u202E•	مدتها: ٩٣ يوم تتكون من ٣ طوالع  الإكليل ٣١ يوم – القلب ٣١ يوم – الشولة ٣١ يوم
 ٦ ديسمبر بداية دخول موسم المربعانية 

•	خصائصها: 
•	تشتد البرودة ليلاً وصباحاً والنهار بارد على معظم المناطق – أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان غالباً يأتي فيه أمطار على معظم المناطق ويتكون الضباب وسحب النفيض وسط وشمال وشرق المملكة - يذكر أن أول ١٠ أيام من المربعانية تعتبر وسم
•	تأتي فيه أحياناً موجات غبار قوية قادمة من العراق وبادية الشام تؤثر على بعض مناطق المملكة 
\u202E•	١٢ ديسمبر تشتد البرودة ليلاً وصباحاً والنهار بارد وأحيان تميل الأجواء للحرارة ظهراً – غالباً يأتي فيه أمطار على معظم المناطق ويتكون الضباب وسحب النفيض وسط وشمال وشرق المملكة
\u202E•	١٢ ديسمبر الانقلاب الشتوي تعامد الشمس على مدار الجدي من بعدها تكون أطول الليالي خلال السنة لمدة أسبوع تقريباُ بعدها تنصرف الشمس باتجاه الشمال ويبدأ النهار بالزيادة على حساب الليل
•	ويأتي برد الانصراف (لا برد الابعد انصراف) انصراف الشمس ناحية الشمال
•	بداية اشتداد البرد - تعمق المنخفضات القطبية فترة تساقط الثلوج على بلاد الشام تطال شمال المملكة احياناً
\u202E•	١ يناير أبرد أيام السنة وشدتها على معظم مناطق المملكة ويتكون الصقيع خاصة في الأماكن المكشوفة البراري أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان    أمطاره عامه وديمية إن الله أراد على معظم المناطق   فترة تساقط الثلوج على المناطق الشمالية    وتزداد الرطوبة على معظم المناطق ويتكون الضباب وسحب النفيض وترتفع الحرارة نهاراً أحياناً
\u202E•	٣ يناير الى ٨١ يناير يوافق اقصى مدى بالتأخر لشروق الشمس طوال العام 
\u202E•	٨ يناير الى ٠٢ يناير يوافق اقصى مدى في التأخر لصلاة الفجر طوال العام
•	١٣ يناير نهاية موسم المربعانية """,
      'assets/images/zodiac_winter_back.png',
      0xff65A8AF,

    ],

    ["الشبط", 
      """موسم شدة البرد
\u202E•	مدتها: ٦٢ يوم تتكون من طالعين   طالع النعائم ٣١ يوم – طالع البلدة ٣١ يوم 
•	١٤ يناير بداية موسم الشبط 
•	خصائصها: 
\u202E•	٤١ يناير أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع خاصة في الأماكن المكشوفة البراري والمرتفعات - فيه (برد يسمى برد الأزيرق) أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان ترتفع الحرارة نهاراً أحياناً - يتكون الضباب يكثر به نشاط الرياح وتأتي فيه موجات غبار ويتكدر الجو قليل الامطار في الغالب فترة تساقط الثلوج على المناطق الشمالية 
\u202E•	٧٢ يناير أبرد أيام السنة وشدتها على معظم المناطق وتكون الصقيع   خاصة في الأماكن المكشوفة البراري والمرتفعات
•	فيه برد يسمى (برد الأزيرق) أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان
\u202E•	ترتفع الحرارة أحياناً نهاراً- يتكون فيه الضباب يكثر به نشاط الرياح وتأتي فيه موجات غبار ويتكدر الجو ٦ فبراير تدخل أيام (بذرة الست) وهي ٦ أيام صالحة لزراعة أي شي فترة تساقط الثلوج على المناطق الشمالية 
•	نهاية حالات الكسير على سواحل البحر الأحمر
•	٨ فبراير نهاية موسم الشبط
      """,
      'assets/images/zodiac_winter_back.png',
      0xff65A8AF,

    ],

    ["العقارب", 
      """فترة نهاية الشتاء ودخول الربيع وتقلب الأجواء والانتقال من البرودة للاعتدال وتكدر الأجواء
\u202Eمدتها: ٩٣ يوم تتكون من ٣ طوالع: طالع سعد الذابح ٣١ يوم – طالع سعد بلع ٣١ يوم – طالع سعد السعود ٣١ يوم
بدايتها: ٩ فبراير بداية موسم العقارب
خصائصها:
\u202E•	٩ فبراير الأجواء لاتزال باردة على معظم المناطق يأتي فيه أيام دفء تعقبها موجة برد وبرده شديد يتكون فيه الضباب - أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان    تقل فيه الامطار على معظم المناطق   وتكون أمطاره غزيرة في مواسم قليلة تنشط فيه الرياح والأجواء تكون متكدرة يأتي فيه موجات غبار على مناطق المملكة نهاية تساقط الثلوج
\u202E•	٢٢ فبراير الأجواء لازالت باردة على معظم المناطق وبداية انكسار موجة البرد الأجواء باردة صباحاً تميل للاعتدال والحرارة ظهراً يأتي فيه برد بعد موجة دفء (برد العجوز) أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان أمطاره قليلة في الغالب على معظم المناطق وتكون أمطاره غزيرة في مواسم قليلة - تنشط فيه الرياح وتكدر الأجواء ويأتي فيه موجات غبار- 6 مارس نهاية فصل الشتاء
\u202E•	٧ مارس بداية الربيع الأجواء باردة صباحا تميل للاعتدال والحرارة ظهراً ويأتي فيه برد بعد دفء (برد بياع الخبل عباته) وتحدث فيه تقلبات جوية وأمطار وتنشط فيه الرياح المثيرة للغبار وتكدر الأجواء على المنطقة الوسطى والشرقية والشمالية، أجواء معتدلة على سواحل وسط البحر الأحمر وسواحل جازان، التخفيف من الملابس الشتوية واخراج الملابس الربيعية 
•	١٩ مارس نهاية موسم العقارب
""",
      'assets/images/zodiac_winter_back.png',
      0xff65A8AF,

    ],

    ["الحميمين", 
      """تقلب الأجواء وبداية ارتفاع الحرارة وتكدر الأجواء ونشاط الرياح
\u202E• مدته: ٦٢ يوم تتكون من طالعين طالع سعد الاخبية ٣١ يوم – طالع المقدم ٣١ يوم
\u202E•	٠٢ مارس بداية موسم الحميمين بداية موسم سبق السرايات أمطار الربيع (مراويح الصيف) الأجواء فيه متقلبة أمطار تساقط البرد شدة الرياح مثيرة للغبار تفاوت في درجات الحرارة بين ارتفاع وانخفاض، تمييل الأجواء للاعتدال صباحاً وترتفع الحرارة نهاراً على الوسطى والشرقية والغربية وتميل للبرودة صباحاً وليلاً على المناطق الشمالية والمرتفعات الجنوبية الغربية 
•	يأتي فيه احياناً برد يهلك الزرع يسمى (برد الحميمين) على الوسطى والشمالية تكثر به أمراض الحساسية والزكام 
•	خصائصه: 
\u202E•	١٢-٢٢ مارس الاعتدال الربيعي تعامد الشمس على خط الاستواء يتساوى فيه الليل والنهار ويبدأ النهار بالزيادة
\u202E•	١٢ مارس بداية تأثير المنخفضات الخماسينية على المملكة مصدرها الصحراء الكبرى بأفريقيا (نشاط عالي للرياح السطحية المثيرة للغبار وارتفاع في درجات الحرارة يليه انخفاض في درجات الحرارة) تكثر به أمراض الحساسية والزكام
•	١٤ أبريل نهاية موسم الحميمين
""",
      'assets/images/zodiac_spring_back.png',
      0xff6C7D47,

    ],

    ["السرايات", 
      """شدة تقلبات الأجواء
•	مدتها: ٣٩ يوم   تتكون من ٣ طوالع
\u202Eطالع المؤخر ٣١ يوم – طالع الرشا ٣١ يوم – طالع الشرطين ٣١ يوم
•	١٥ أبريل بداية موسم السرايات
•	خصائصها:
\u202E•	٥١ ابريل بداية موسم السرايات أمطار الربيع (مراويح الصيف) الأجواء بمشيئة الله تميل للحرارة نهاراً معتدلة صباحاً وليلاً تكون فيه تقلبات الأجواء شديدة سقوط الأمطار الغزيرة وتساقط البرد وهبوب العواصف والرياح الهابطة المثيرة للغبار وتشكل موجات غبار كثيفة على مناطق الرياض القصيم حائل الشرقية الشمالية مكة المدينة نجران المرتفعات وشرق المرتفعات يأتي فيه موجات برد على المناطق الشمالية وحائل تصل أحياناً الى منطقة القصيم والرياض. 
•	اخراج الملابس الصيفة
\u202E•	١٢ أبريل بداية الفترة الأولى لأعاصير ومنخفضات بحر العرب تنتهي ١٢ يونيو
\u202E•	٨٢ ابريل استمرار موسم السرايات (مراويح الصيف) تقلبات الأجواء بمشيئة الله سقوط الامطار الغزيرة وتساقط البرد وهبوب العواصف والرياح الهابطة المثيرة للغبار مناطق الرياض القصيم حائل الشرقية الشمالية مكة المدينة نجران المرتفعات وشرق المرتفعات 
•	ارتفاع ملموس لدرجات الحرارة نهاراً معتدلة ليلاً وسط وشرق وغرب المملكة وأجواء معتدلة على المرتفعات والمناطق الشمالية
•	٢٣ مايو نهاية موسم السرايات
    """,
      'assets/images/zodiac_spring_back.png',
      0xff6C7D47,
    ],

    ["كنة الثريا", 
      """٢٨ أبريل – ٥ يونيو
مدتها: ٣٩ يوم تتكون من ٣ طوالع
\u202Eطالع الرشا ٣١ يوم طالع الشرطين ٣١ يوم طالع البطين ٣١ يوم
• موسم الكنة مرحلة فاصلة بين بداية الحر وهو الصيف، وشدة الحر القيظ 
خصائصها:
بدايتها معتدلة الأجواء تكثر بها تقلبات الأجواء والامطار وآخرها حارة تقل فيها الامطار
•	فيها موسم السرايات
•	١٠ مايو نهاية الربيع محلياً
•	١١ مايو بداية الصيف محلياً
\u202E•	٠٢ نهاية المنخفضات الخماسينية ومنخفضات البحر المتوسط 
•	٢٣ نهاية موسم السرايات 
•	٢٤ مايو بداية موسم البوارح 
•	٢٨ مايو تعامد الشمس على الكعبة التعامد الأول
•	٥ يونيو نهاية موسم الكنة
      """,
      'assets/images/zodiac_spring_back.png',
      0xff6C7D47,
    ],

  ];

}